In [10]:
# Loading the dataset using pandas

import pandas as pd

df = pd.read_excel('Retail-Supply-Chain-Sales-Dataset.xlsx')

df.head(4)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Product ID,Category,Sub-Category,Product Name,Returned,Sales,Quantity,Discount,Profit,Delivery in Days
0,1,CA-2016-152156,2016-08-11,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,Not,261.9600,2,0.00,41.9136,92
1,2,CA-2016-152156,2016-08-11,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",Not,731.9400,3,0.00,219.5820,92
2,3,CA-2016-138688,2016-12-06,2016-12-06,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,Not,14.6200,2,0.00,6.8714,0
3,4,US-2015-108966,2015-11-10,2015-11-10,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,Not,957.5775,5,0.45,-383.0310,0

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 24 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Row ID               9994 non-null   int64
 1   Order ID             9994 non-null   object
 2   Order Date           9994 non-null   datetime64[ns]
 3   Ship Date            9994 non-null   datetime64[ns]
 4   Ship Mode            9994 non-null   object
 5   Customer ID          9994 non-null   object
 6   Customer Name        9994 non-null   object
 7   Segment              9994 non-null   object
 8   Country              9994 non-null   object
 9   City                 9994 non-null   object
 10  State                9994 non-null   object
 11  Postal Code          9994 non-null   int64
 12  Region               9994 non-null   object
 13  Retail Sales People  9994 non-null   object
 14  Product ID           9994 non-null   object
 15  Category             9994 non-null   object
 16  Sub-Category         9994 non-null   object
 17  Product Name         9994 non-null   object
 18  Returned             9994 non-null   object
 19  Sales                9994 non-null   float64
 20  Quantity             9994 non-null   int64
 21  Discount             9994 non-null   float64
 22  Profit               9994 non-null   float64
 23  Delivery in Days     9994 non-null   int64
dtypes: datetime64[ns](2), float64(3), int64(4), object(15)
memory usage: 1.8+ MB

In [20]:
# Summary statistics using .describe()

df.describe(include='all')

,Date,Year,Quarter,Quarter (Q),Quarter & Year,Month,Month Name,Month & Year,Week of Year,Week of Year (W),Day of Week,Day Name
count,1826,1826.000000,1826.000000,1826,1826,1826.000000,1826,1826,1826.000000,1826,1826.000000,1826
unique,NaN,NaN,NaN,4,20,NaN,12,60,NaN,53,NaN,7
top,NaN,NaN,NaN,Q3,2016 - Q3,NaN,Jul,Jul 2016,NaN,Week 27,NaN,Friday
freq,NaN,NaN,NaN,460,92,NaN,155,31,NaN,35,NaN,261
mean,2016-07-01 12:00:00,2016.000000,2.508762,NaN,NaN,6.523549,NaN,NaN,27.014239,NaN,4.001095,NaN
min,2014-01-01 00:00:00,2014.000000,1.000000,NaN,NaN,1.000000,NaN,NaN,1.000000,NaN,1.000000,NaN
25%,2015-04-02 06:00:00,2015.000000,2.000000,NaN,NaN,4.000000,NaN,NaN,14.000000,NaN,2.000000,NaN
50%,2016-07-01 12:00:00,2016.000000,3.000000,NaN,NaN,7.000000,NaN,NaN,27.000000,NaN,4.000000,NaN
75%,2017-09-30 18:00:00,2017.000000,4.000000,NaN,NaN,10.000000,NaN,NaN,40.000000,NaN,6.000000,NaN
max,2018-12-31 00:00:00,2018.000000,4.000000,NaN,NaN,12.000000,NaN,NaN,53.000000,NaN,7.000000,NaN
std,NaN,1.414214,1.117326,NaN,NaN,3.449478,NaN,NaN,15.069985,NaN,2.000548,NaN

In [ ]:
# Checking if missing date or null values are present in the dataset   

df.isnull().sum()

Date                0
Year                0
Quarter             0
Quarter (Q)         0
Quarter & Year      0
Month               0
Month Name          0
Month & Year        0
Week of Year        0
Week of Year (W)    0
Day of Week         0
Day Name            0
dtype: int64

In [ ]:
df.columns.to_list()

['Row ID',
 'Order ID',
 'Order Date',
 'Ship Date',
 'Ship Mode',
 'Customer ID',
 'Customer Name',
 'Segment',
 'Country',
 'City',
 'State',
 'Postal Code',
 'Region',
 'Retail Sales People',
 'Product ID',
 'Category',
 'Sub-Category',
 'Product Name',
 'Returned',
 'Sales',
 'Quantity',
 'Discount',
 'Profit',
 'Delivery in Days']

In [ ]:
# Checking for duplicated 

df.duplicated().sum()

np.int64(0)

In [ ]:
# Renaming columns according to snake casing for better readability and documentation

df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(' ','_')
df = df.rename(columns={'sub-category':'sub_category'})

In [16]:
df.columns

Index(['row_id', 'order_id', 'order_date', 'ship_date', 'ship_mode',
       'customer_id', 'customer_name', 'segment', 'country', 'city', 'state',
       'postal_code', 'region', 'retail_sales_people', 'product_id',
       'category', 'sub_category', 'product_name', 'returned', 'sales',
       'quantity', 'discount', 'profit', 'delivery_in_days'],
      dtype='object')

In [ ]:
from sqlalchemy import create_engine

# Mysql Connection
username = "root"
password = "root"
host = "localhost"
port = "3306"
database = "retail_supply"

engine = create_engine(f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}")

# Write DataFrame to Mysql
table_name = "retail"  # choose any table name
df.to_sql(table_name, engine, if_exists="replace", index=False)

# Read back sample
pd.read_sql("select * from retail limit 5;", engine)

,row_id,order_id,order_date,ship_date,ship_mode,customer_id,customer_name,segment,country,city,...,product_id,category,sub_category,product_name,returned,sales,quantity,discount,profit,delivery_in_days
0,1,CA-2016-152156,2016-08-11,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,Not,261.9600,2,0.00,41.9136,92
1,2,CA-2016-152156,2016-08-11,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",Not,731.9400,3,0.00,219.5820,92
2,3,CA-2016-138688,2016-12-06,2016-12-06,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,Not,14.6200,2,0.00,6.8714,0
3,4,US-2015-108966,2015-11-10,2015-11-10,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,Not,957.5775,5,0.45,-383.0310,0
4,5,US-2015-108966,2015-11-10,2015-11-10,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,Not,22.3680,2,0.20,2.5164,0

In [ ]:
# Add the second sheet

df = pd.read_excel('Retail-Supply-Chain-Sales-Dataset.xlsx', sheet_name='Calendar Table')

df.head(4)

,Date,Year,Quarter,Quarter (Q),Quarter & Year,Month,Month Name,Month & Year,Week of Year,Week of Year (W),Day of Week,Day Name
0,2016-07-01,2016,3,Q3,2016 - Q3,7,Jul,Jul 2016,27,Week 27,5,Friday
1,2016-07-02,2016,3,Q3,2016 - Q3,7,Jul,Jul 2016,27,Week 27,6,Saturday
2,2016-07-03,2016,3,Q3,2016 - Q3,7,Jul,Jul 2016,27,Week 27,7,Sunday
3,2016-07-04,2016,3,Q3,2016 - Q3,7,Jul,Jul 2016,28,Week 28,1,Monday

In [19]:
from sqlalchemy import create_engine

# Mysql Connection
username = "root"
password = "root"
host = "localhost"
port = "3306"
database = "retail_supply"

engine = create_engine(f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}")

# Write DataFrame to Mysql
table_name = "calendar"  # choose any table name
df.to_sql(table_name, engine, if_exists="replace", index=False)

# Read back sample
pd.read_sql("select * from calendar limit 5;", engine)

,Date,Year,Quarter,Quarter (Q),Quarter & Year,Month,Month Name,Month & Year,Week of Year,Week of Year (W),Day of Week,Day Name
0,2016-07-01,2016,3,Q3,2016 - Q3,7,Jul,Jul 2016,27,Week 27,5,Friday
1,2016-07-02,2016,3,Q3,2016 - Q3,7,Jul,Jul 2016,27,Week 27,6,Saturday
2,2016-07-03,2016,3,Q3,2016 - Q3,7,Jul,Jul 2016,27,Week 27,7,Sunday
3,2016-07-04,2016,3,Q3,2016 - Q3,7,Jul,Jul 2016,28,Week 28,1,Monday
4,2016-07-05,2016,3,Q3,2016 - Q3,7,Jul,Jul 2016,28,Week 28,2,Tuesday